In [0]:
import numpy as np
import pandas as pd
from google.colab import drive
drive.mount('/content/drive/')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive/

## Punto 1

In [0]:
# before normalizing the loan_lenders.csv table, let's check that each username
# doesn't contain spaces or commas
data_folder_path = '/content/drive/' + 'My Drive/Colab Notebooks/' + 'additional-kiva-snapshot/'
lenders = pd.read_csv(data_folder_path + 'lenders.csv')
pd.set_option('display.max_rows', 10)
lenders

         permanent_name display_name  ... invited_by num_invited
0              qian3013         Qian  ...        NaN           0
1             reena6733        Reena  ...        NaN           0
2               mai5982          Mai  ...        NaN           0
3        andrew86079135       Andrew  ...  Peter Tan           0
4            nguyen6962       Nguyen  ...        NaN           0
...                 ...          ...  ...        ...         ...
2349169       janet7309        Janet  ...        NaN           0
2349170          pj4198          NaN  ...        NaN           0
2349171       maria2141        Maria  ...        NaN           0
2349172      simone9846       Simone  ...        NaN           0
2349173      laurie1160       Laurie  ...     Verian           0

[2349174 rows x 11 columns]

In [0]:
space = lenders['permanent_name'].str.find(' ') == -1
comma = lenders['permanent_name'].str.find(',') == -1
total = space & comma
del space, comma
assert np.any(total), 'Invalid account name'
del total

In [0]:
loan_lenders = pd.read_csv(data_folder_path + 'loans_lenders.csv')
loan_lenders

         loan_id                                            lenders
0         483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1         483738  muc888, nora3555, williammanashi, barbara5610,...
2         485000  muc888, terrystl, richardandsusan8352, sherri4...
3         486087  muc888, james5068, rudi5955, daniel9859, don92...
4         534428  muc888, niki3008, teresa9174, mike4896, david7...
...          ...                                                ...
1387427   678999  michael43411218, carol5987, gooddogg1, chris41...
1387428  1207353  rjhoward1986, jeffrey6870, trolltech4460, elys...
1387429  1206220  vicky7746, gooddogg1, fairspirit, craig9729960...
1387430  1206425  rich6705, sergiiy9766, angela7509, barbara5610...
1387431  1206486                              alan5175, amy38101311

[1387432 rows x 2 columns]

In [0]:
lenders_list = loan_lenders.lenders.str.split(', ')
lengths = [len(l) for l in lenders_list.values]
lengths
norm_loan_lenders = pd.DataFrame({'loan_id': np.repeat(loan_lenders['loan_id'].values, lengths),
                       'lender': np.concatenate(lenders_list)})
norm_loan_lenders

          loan_id             lender
0          483693             muc888
1          483693            sam4326
2          483693        camaran3922
3          483693        lachheb1865
4          483693        rebecca3499
...           ...                ...
28293926  1206425  trogdorfamily7622
28293927  1206425          danny6470
28293928  1206425            don6118
28293929  1206486           alan5175
28293930  1206486        amy38101311

[28293931 rows x 2 columns]

# Secondo Punto

In [0]:
loans = pd.read_csv(data_folder_path + 'loans.csv')
pd.set_option('display.max_columns', 100)
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1419602,988180,NaN,NaN,NaN,NaN,400.0,400.0,funded,Tailoring,Services,NaN,KE,Kenya,NaN,shared,0.1,KES,138.0,2015-12-01 04:49:50.000 +0000,2016-01-02 01:00:03.000 +0000,2015-11-23 08:00:00.000 +0000,2015-12-28 15:44:18.000 +0000,14.0,16,4,2,"#Parent, #Repeat Borrower, #Woman Owned Biz",NaN,NaN,monthly,field_partner
1419603,988213,Perlita,English,"Perlita is 52 years old, married and has three...","Perlita is 52 years old, married and has three...",300.0,300.0,funded,Pigs,Agriculture,to buy feeds and other supplies to raise her pigs,PH,Philippines,"Numancia, Aklan",shared,0.1,PHP,145.0,2015-12-01 05:13:30.000 +0000,2016-01-02 16:40:07.000 +0000,2015-11-24 08:00:00.000 +0000,2015-12-22 10:37:06.000 +0000,14.0,12,1,1,"#Animals, #Elderly, #Repeat Borrower, #Woman O...",female,true,irregular,field_partner
1419604,989109,Okyeso Nyame Group,English,Okyeso Nyame group will begin its third cycle ...,Okyeso Nyame group will begin its third cycle ...,2425.0,2425.0,funded,Bakery,Food,"to buy margarine, flour and sugar at wholesale...",GH,Ghana,Chorkor,shared,0.1,GHS,231.0,2015-12-02 10:56:28.000 +0000,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000,2015-12-26 20:24:47.000 +0000,8.0,76,2,1,"user_favorite, #Parent, #Vegan, #Woman Owned B...","female, female, female, male, male, female","true, true, true, true, true, true",irregular,field_partner
1419605,989143,Exequila,English,"Exequila is from San Miguel, Bohol. She is in...","Exequila is from San Miguel, Bohol. She is in...",100.0,100.0,funded,Farming,Agriculture,to buy feed and piglets,PH,Philippines,"San Miguel, Bohol",shared,0.1,PHP,125.0,2015-12-02 11:41:46.000 +0000,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000,2015-12-06 21:03:57.000 +0000,12.0,3,1,1,NaN,female,true,irregular,field_partner
1419606,989240,Lydia,French,Lydia a 37ans et habite dans une zone rurale. ...,Lydia is 37 years old and lives in a rural are...,175.0,175.0,funded,Sewing,Services,"to buy a sewing machine, a sewing machine moto...",MG,Madagascar,Antananarivo,shared,0.1,MGA,443.0,2015-12-02 13:55:07.000 +0000,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000,2015-12-04 23:17:04.000 +0000,14.0,7,1,1,NaN,female,true,monthly,field_partner

Le due colonne di interesse sono inizialmente codificate come stringhe di testo, è necessario convertirle in un formato adatto a dati temporali. Eventuali valori nulli o non validi, sono automaticamente gestiti da Pandas e diventano <pandas._libs.tslibs.nattype.NaTType>. Per esempio:

In [0]:
print('Esempio di dato mancante:', loans['disburse_time'][64])
loans['disburse_time'] = pd.to_datetime(loans['disburse_time'])
loans['planned_expiration_time'] = pd.to_datetime(loans['planned_expiration_time'])
print('... convertito in NaT', loans['disburse_time'][64])

Esempio di dato mancante: 2010-11-18 08:00:00.000 +0000
... convertito in NaT 2010-11-18 08:00:00+00:00

I NaT si propagano come i nan per i float, per cui qualsiasi operazione algebrica su di essi restisce NaT. Calcolando la differenza sottostante quindi le entrate NaT rimarranno tali

In [0]:
print('Propagazione dei NaT:', (loans['disburse_time'] - loans['planned_expiration_time'])[64])

Propagazione dei NaT: NaT

In [0]:
loans['duration'] = loans['disburse_time'] - loans['planned_expiration_time']

In [0]:
loans[['planned_expiration_time', 'disburse_time', 'duration']]

          planned_expiration_time             disburse_time           duration
0       2014-02-14 03:30:06+00:00 2013-12-22 08:00:00+00:00 -54 days +04:29:54
1       2014-03-26 22:25:07+00:00 2013-12-20 08:00:00+00:00 -97 days +09:34:53
2       2014-02-15 21:10:05+00:00 2014-01-09 08:00:00+00:00 -38 days +10:49:55
3       2014-02-21 03:10:02+00:00 2014-01-17 08:00:00+00:00 -35 days +04:49:58
4       2014-02-13 06:10:02+00:00 2013-12-17 08:00:00+00:00 -58 days +01:49:58
...                           ...                       ...                ...
1419602 2016-01-02 01:00:03+00:00 2015-11-23 08:00:00+00:00 -40 days +06:59:57
1419603 2016-01-02 16:40:07+00:00 2015-11-24 08:00:00+00:00 -40 days +15:19:53
1419604 2016-01-03 22:20:04+00:00 2015-11-13 08:00:00+00:00 -52 days +09:39:56
1419605 2016-01-05 08:50:02+00:00 2015-11-03 08:00:00+00:00 -64 days +23:09:58
1419606 2016-01-03 20:50:06+00:00 2015-11-03 08:00:00+00:00 -62 days +11:09:54

[1419607 rows x 3 columns]

# Terzo Punto

Quello che segue è il metodo più rapido per ottenere quali utenti abbiano presato denaro più di una volta. Alternativamente, si possono contare le occorrenze di ciascun nome nella tabella norm_loan_lenders, per poi tenere solo quelli con conteggio > 1. Tuttavia, se il database è coerente i due metodi dovrebbero identificare gli stessi utenti. Il primo metodo è più rapido da scrivere ed eseguire, e permette di restituire anche altri dati dei soggetti senza ulteriori query.

In [0]:
lenders[lenders['loan_purchase_num'] > 1]

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
6,rene7585,Rene,NaN,NaN,NaN,1461301636,NaN,NaN,2.0,NaN,0
7,harald2826,Harald,NaN,NaN,NaN,1461301670,NaN,NaN,2.0,NaN,0
11,jennifer4328,Jennifer,NaN,NaN,NaN,1461302712,NaN,NaN,3.0,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...
2349158,rakhi,Rakhi,New York,New York,US,1342100607,Student,I care.,4.0,NaN,0
2349162,james75291930,James,NaN,NaN,NaN,1342096854,NaN,NaN,6.0,NaN,0
2349164,carol8279,Carol,NaN,NaN,NaN,1342099416,NaN,NaN,5.0,NaN,0
2349166,eric91401545,Eric,NaN,NaN,NaN,1342100719,NaN,NaN,2.0,NaN,0
2349171,maria2141,Maria,NaN,NaN,US,1342099723,NaN,NaN,2.0,NaN,0

# Quarto Punto

Si può interrogare equivalentemente con 'country_code'. Se la tabella è fatta in modo corretto, i due metodi sono equivalenti.

In [0]:
loans['country_name'].value_counts()

Philippines         285336
Kenya               143699
Peru                 86000
Cambodia             79701
El Salvador          64037
                     ...
Uruguay                  1
Canada                   1
Botswana                 1
Mauritania               1
Papua New Guinea         1
Name: country_name, Length: 96, dtype: int64

# Quinto Punto

Il codice seguente permette di soddisfare la richiesta. Si noti che le cifre sono tutte in dollari USD.

In [0]:
loan_amount_by_ctry = loans.groupby(by = 'country_code').aggregate({'funded_amount': 'sum'})
loan_amount_by_ctry.rename({'funded_amount': 'received_amount'}, axis = 'columns', inplace = True)
loan_amount_by_ctry

              received_amount
country_code
AF                  1964650.0
AL                  3992475.0
AM                 20284675.0
AZ                 14191350.0
BA                   477250.0
...                       ...
XK                  2862325.0
YE                  3340025.0
ZA                  1006525.0
ZM                  1913250.0
ZW                  5818550.0

[95 rows x 1 columns]

# Sesto Punto

In [0]:
loan_amount_by_ctry['received_amount_(%)'] = loan_amount_by_ctry['received_amount']/sum(loan_amount_by_ctry['received_amount'])
loan_amount_by_ctry

              received_amount  received_amount_(%)
country_code
AF                  1964650.0             0.001738
AL                  3992475.0             0.003533
AM                 20284675.0             0.017949
AZ                 14191350.0             0.012557
BA                   477250.0             0.000422
...                       ...                  ...
XK                  2862325.0             0.002533
YE                  3340025.0             0.002955
ZA                  1006525.0             0.000891
ZM                  1913250.0             0.001693
ZW                  5818550.0             0.005148

[95 rows x 2 columns]

# Settimo Punto

In [0]:
loans_amount_by_yr_ctry = pd.DataFrame({'loan_count': loans.groupby(['country_code', loans.disburse_time.dt.year]).size()})
loans_amount_by_yr_ctry['received_amount'] = loans.groupby(['country_code', loans.disburse_time.dt.year]).aggregate({'funded_amount': 'sum'})
loans_amount_by_yr_ctry['received_amount_(%)'] = loans_amount_by_yr_ctry['received_amount']/sum(loans_amount_by_yr_ctry['received_amount'])
loans_amount_by_yr_ctry

                            loan_count  received_amount  received_amount_(%)
country_code disburse_time
AF           2007.0                408         194975.0             0.000173
             2008.0                370         365375.0             0.000324
             2009.0                678         581825.0             0.000516
             2010.0                632         563350.0             0.000499
             2011.0                247         245125.0             0.000217
...                                ...              ...                  ...
ZW           2013.0                426         678525.0             0.000601
             2014.0               2078        1307975.0             0.001159
             2015.0                600         723150.0             0.000641
             2016.0                808         787550.0             0.000698
             2017.0               1079        1214125.0             0.001076

[745 rows x 3 columns]

# Ottavo Punto

Esistono numerosi modi per completare questo punto. Il più rapido dal punto di vista compitazionale è calcolare, per ogni prestito, la somma corrisposta da ogni utente, per poi raggruppare per permanent_name e sommare le cifre prestate.

In [0]:
loan_lenders = pd.DataFrame({'lenders': lenders_list, '#_lenders': lengths}, index = loan_lenders['loan_id'])
loan_lenders

                                                   lenders  #_lenders
loan_id
483693   [basit1534, douglas1733, susan3184, omar7511, ...         40
483738   [paolo2317, wakibi, maryanne2415, FrequentMile...         15
485000   [porter9696, ursula4131, maura4896, patricia41...         15
486087   [johnandjudy9603, jennie3672, cardsforkiva, ni...         13
534428   [marian3053, shoghi5044, adam71648668, arvem, ...         19
...                                                    ...        ...
678999   [jon60483449, jason80228136, michael77132241, ...         10
1207353              [JY1024, bruce001, mike001, bill4198]          5
1206220  [alison6664, nms, zeshan3266, james1472, barba...         44
1206425  [matthias1958, laurie8580, barbara5610, jim456...          8
1206486  [menno3710, alexander4694, antoine8599, JY1024...          2

[1387432 rows x 2 columns]

Reindicizzare la tabella loans e le successive permette di effettuare query più rapide.

In [0]:
assert loans['loan_id'].unique().size == loans.shape[0]
loans.set_index(loans['loan_id'], inplace = True)
loans.drop('loan_id', axis = 'columns', inplace = True)
loans

,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model,duration
loan_id,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06+00:00,2013-12-22 08:00:00+00:00,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner,-54 days +04:29:54
657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07+00:00,2013-12-20 08:00:00+00:00,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner,-97 days +09:34:53
658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05+00:00,2014-01-09 08:00:00+00:00,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner,-38 days +10:49:55
659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02+00:00,2014-01-17 08:00:00+00:00,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner,-35 days +04:49:58
656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02+00:00,2013-12-17 08:00:00+00:00,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner,-58 days +01:49:58
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
988180,NaN,NaN,NaN,NaN,400.0,400.0,funded,Tailoring,Services,NaN,KE,Kenya,NaN,shared,0.1,KES,138.0,2015-12-01 04:49:50.000 +0000,2016-01-02 01:00:03+00:00,2015-11-23 08:00:00+00:00,2015-12-28 15:44:18.000 +0000,14.0,16,4,2,"#Parent, #Repeat Borrower, #Woman Owned Biz",NaN,NaN,monthly,field_partner,-40 days +06:59:57
988213,Perlita,English,"Perlita is 52 years old, married and has three...","Perlita is 52 years old, married and has three...",300.0,300.0,funded,Pigs,Agriculture,to buy feeds and other supplies to raise her pigs,PH,Philippines,"Numancia, Aklan",shared,0.1,PHP,145.0,2015-12-01 05:13:30.000 +0000,2016-01-02 16:40:07+00:00,2015-11-24 08:00:00+00:00,2015-12-22 10:37:06.000 +0000,14.0,12,1,1,"#Animals, #Elderly, #Repeat Borrower, #Woman O...",female,true,irregular,field_partner,-40 days +15:19:53
989109,Okyeso Nyame Group,English,Okyeso Nyame group will begin its third cycle ...,Okyeso Nyame group will begin its third cycle ...,2425.0,2425.0,funded,Bakery,Food,"to buy margarine, flour and sugar at wholesale...",GH,Ghana,Chorkor,shared,0.1,GHS,231.0,2015-12-02 10:56:28.000 +0000,2016-01-03 22:20:04+00:00,2015-11-13 08:00:00+00:00,2015-12-26 20:24:47.000 +0000,8.0,76,2,1,"user_favorite, #Parent, #Vegan, #Woman Owned B...","female, female, female, male, male, female","true, true, true, true, true, true",irregular,field_partner,-52 days +09:39:56
989143,Exequila,English,"Exequila is from San Miguel, Bohol. She is in...","Exequila is from San Miguel, Bohol. She is in...",100.0,100.0,funded,Farming,Agriculture,to buy feed and piglets,PH,Philippines,"San Miguel, Bohol",shared,0.1,PHP,125.0,2015-12-02 11:41:46.000 +0000,2016-01-05 08:50:02+00:00,2015-11-03 08:00:00+00:00,2015-12-06 21:03:57.000 +0000,12.0,3,1,1,NaN,female,true,irregular,field_partner,-64 days +23:09:58
989240,Lydia,French,Lydia a 37ans et habite dans une zone rurale. ...,Lydia is 37 years old and lives in a rural are...,175.0,175.0,funded,Sewing,Services,"to buy a sewing machine, a sewing machine moto...",MG,Madagascar,Antananarivo,shared,0.1,MGA,443.0,2015-12-02 13:55:07.000 +0000,2016-01-03 20:50:06+00:00,2015-11-03 08:00:00+00:00,2015-12-04 23:17:04.000 +0000,14.0,7,1,1,NaN,female,true,monthly,field_partner,-62 days +11:09:54

In [0]:
# calcola la cifra messa a disposizione da ciascun partecipante, prestito per prestito
loan_lenders['total_fa'] = loans.loc[loan_lenders.index, 'funded_amount']
loan_lenders['per_user_fa'] = loan_lenders['total_fa']/loan_lenders['#_lenders']
loan_lenders

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:961: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

,lenders,#_lenders,total_fa,per_user_fa
loan_id,,,,
483693,"[basit1534, douglas1733, susan3184, omar7511, ...",40,1225.0,30.625000
483738,"[paolo2317, wakibi, maryanne2415, FrequentMile...",15,500.0,33.333333
485000,"[porter9696, ursula4131, maura4896, patricia41...",15,725.0,48.333333
486087,"[johnandjudy9603, jennie3672, cardsforkiva, ni...",13,400.0,30.769231
534428,"[marian3053, shoghi5044, adam71648668, arvem, ...",19,625.0,32.894737
...,...,...,...,...
678999,"[jon60483449, jason80228136, michael77132241, ...",10,325.0,32.500000
1207353,"[JY1024, bruce001, mike001, bill4198]",5,200.0,40.000000
1206220,"[alison6664, nms, zeshan3266, james1472, barba...",44,2175.0,49.431818
1206425,"[matthias1958, laurie8580, barbara5610, jim456...",8,325.0,40.625000
1206486,"[menno3710, alexander4694, antoine8599, JY1024...",2,150.0,75.000000

In [0]:
# calcola la somma totale corrisposta da ogni prestatore
lender_fa = norm_loan_lenders.set_index(norm_loan_lenders['loan_id'])
lender_fa = lender_fa.join(other = loan_lenders['per_user_fa'])
lender_fa = lender_fa.groupby('lender').aggregate({'per_user_fa': 'sum'})
lender_fa.name = 'tot_lended'
lender_fa

                 per_user_fa
lender
000              1703.868411
00000            1379.750248
0002             2472.563566
00mike00           52.631579
0101craign0101   2623.565117
...                      ...
zzmcfate        63381.546705
zzpaghetti9994     51.020408
zzrvmf8538        513.213719
zzzsai            267.667370
zzzworld           27.522936

[1383799 rows x 1 columns]

# Nono Punto

In [0]:
# add per_user_fa column to lenders table
lenders = lenders.join(other = lender_fa, on = 'permanent_name')
lenders.loc[lenders['per_user_fa'].isna(), 'per_user_fa'] = 0
lenders

In [0]:
# add 'received_amount' column to 'loan_amount_by_country' table
temp = lenders.groupby('country_code').aggregate({'per_user_fa': 'sum'})
loan_amount_by_ctry = loan_amount_by_ctry.join(other = temp)
loan_amount_by_ctry.rename({'per_user_fa': 'given_amount'}, axis = 'columns', inplace = True)
loan_amount_by_ctry

              received_amount  received_amount_(%)   given_amount
country_code
AF                  1964650.0             0.001738  103629.331281
AL                  3992475.0             0.003533    7914.812157
AM                 20284675.0             0.017949   22088.240642
AZ                 14191350.0             0.012557    8606.683347
BA                   477250.0             0.000422   60187.027589
...                       ...                  ...            ...
XK                  2862325.0             0.002533   11044.982266
YE                  3340025.0             0.002955   16682.978533
ZA                  1006525.0             0.000891  523793.240534
ZM                  1913250.0             0.001693   29279.198780
ZW                  5818550.0             0.005148    5290.306662

[95 rows x 3 columns]

In [0]:
# assign money from lenders without country as specified in the text
na_sum = lenders.loc[lenders['country_code'].isna(), 'per_user_fa'].sum()
loan_amount_by_ctry['given_amount'] += na_sum*loan_amount_by_ctry['received_amount_(%)']
loan_amount_by_ctry

              received_amount  received_amount_(%)  given_amount
country_code
AF                  1964650.0             0.001738  4.905445e+05
AL                  3992475.0             0.003533  7.941866e+05
AM                 20284675.0             0.017949  4.016921e+06
AZ                 14191350.0             0.012557  2.803429e+06
BA                   477250.0             0.000422  1.541759e+05
...                       ...                  ...           ...
XK                  2862325.0             0.002533  5.747468e+05
YE                  3340025.0             0.002955  6.744623e+05
ZA                  1006525.0             0.000891  7.220167e+05
ZM                  1913250.0             0.001693  4.060717e+05
ZW                  5818550.0             0.005148  1.151187e+06

[95 rows x 3 columns]

In [0]:
# finally, compute the difference
loan_amount_by_ctry['diff'] = loan_amount_by_ctry['given_amount'] - loan_amount_by_ctry['received_amount']
loan_amount_by_ctry

              received_amount  received_amount_(%)  given_amount          diff
country_code
AF                  1964650.0             0.001738  4.905445e+05 -1.474106e+06
AL                  3992475.0             0.003533  7.941866e+05 -3.198288e+06
AM                 20284675.0             0.017949  4.016921e+06 -1.626775e+07
AZ                 14191350.0             0.012557  2.803429e+06 -1.138792e+07
BA                   477250.0             0.000422  1.541759e+05 -3.230741e+05
...                       ...                  ...           ...           ...
XK                  2862325.0             0.002533  5.747468e+05 -2.287578e+06
YE                  3340025.0             0.002955  6.744623e+05 -2.665563e+06
ZA                  1006525.0             0.000891  7.220167e+05 -2.845083e+05
ZM                  1913250.0             0.001693  4.060717e+05 -1.507178e+06
ZW                  5818550.0             0.005148  1.151187e+06 -4.667363e+06

[95 rows x 4 columns]

# Decimo Punto

In [0]:
country_stats = pd.read_csv(data_folder_path + 'country_stats.csv')
country_stats

,country_name,country_code,country_code3,continent,region,population,population_below_poverty_line,hdi,life_expectancy,expected_years_of_schooling,mean_years_of_schooling,gni,kiva_country_name
0,India,IN,IND,Asia,Southern Asia,1339180127,21.9,0.623559,68.322,11.696590,6.298834,5663.474799,India
1,Nigeria,NG,NGA,Africa,Western Africa,190886311,70.0,0.527105,53.057,9.970482,6.000000,5442.901264,Nigeria
2,Mexico,MX,MEX,Americas,Central America,129163276,46.2,0.761683,76.972,13.299090,8.554985,16383.106680,Mexico
3,Pakistan,PK,PAK,Asia,Southern Asia,197015955,29.5,0.550354,66.365,8.106910,5.089460,5031.173074,Pakistan
4,Bangladesh,BD,BGD,Asia,Southern Asia,164669751,31.5,0.578824,71.985,10.178706,5.241577,3341.490722,Bangladesh
...,...,...,...,...,...,...,...,...,...,...,...,...,...
169,Somalia,SO,SOM,Africa,Eastern Africa,14742523,NaN,NaN,NaN,NaN,NaN,NaN,Somalia
170,Central African Republic,CF,CAF,Africa,Middle Africa,4659080,NaN,0.352440,51.458,7.098980,4.230000,587.473961,Central African Republic
171,Samoa,WS,WSM,Oceania,Polynesia,196440,NaN,0.702000,NaN,NaN,NaN,NaN,Samoa
172,Palestine,PS,PS,Asia,Western Asia,4920724,NaN,0.677000,NaN,NaN,NaN,NaN,Palestine
173,Kosovo,XK,NaN,Europe,Southern Europe,1895250,30.0,0.786000,NaN,NaN,NaN,NaN,Kosovo

In [0]:
population = pd.Series(data = country_stats['population'].values, index = country_stats['country_code'])
population

country_code
IN    1339180127
NG     190886311
MX     129163276
PK     197015955
BD     164669751
         ...
SO      14742523
CF       4659080
WS        196440
PS       4920724
XK       1895250
Length: 174, dtype: int64

In [0]:
loan_amount_by_ctry['diff_per_cap'] = (loan_amount_by_ctry['diff']/population).dropna()
loan_amount_by_ctry

,received_amount,received_amount_(%),given_amount,diff,diff_per_cap
country_code,,,,,
AF,1964650.0,0.001738,4.905445e+05,-1.474106e+06,-0.041489
AL,3992475.0,0.003533,7.941866e+05,-3.198288e+06,-1.091496
AM,20284675.0,0.017949,4.016921e+06,-1.626775e+07,-5.551282
AZ,14191350.0,0.012557,2.803429e+06,-1.138792e+07,-1.158771
BA,477250.0,0.000422,1.541759e+05,-3.230741e+05,-0.092122
...,...,...,...,...,...
XK,2862325.0,0.002533,5.747468e+05,-2.287578e+06,-1.207006
YE,3340025.0,0.002955,6.744623e+05,-2.665563e+06,-0.094355
ZA,1006525.0,0.000891,7.220167e+05,-2.845083e+05,-0.005016
ZM,1913250.0,0.001693,4.060717e+05,-1.507178e+06,-0.088169
ZW,5818550.0,0.005148,1.151187e+06,-4.667363e+06,-0.282359

In [0]:
# the following method is able to find all maxima, non only the first one
mask = loan_amount_by_ctry['diff_per_cap'] == loan_amount_by_ctry['diff_per_cap'].max()
loan_amount_by_ctry.loc[mask, :]

,received_amount,received_amount_(%),given_amount,diff,diff_per_cap
country_code,,,,,
CA,50000.0,0.000044,7.634458e+07,7.629458e+07,2.083174

Il maggior surplus di donazioni pro capita spetta al Canada, in cui ogni persona ha in media donato 2$ in più di quanti ne abbia ricevuti.

# Undicesimo Punto